In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.986401  1.169657 -1.687242  2.392745
2013-01-02  0.808653 -0.623405  0.848104  0.043162
2013-01-03  1.004945  1.660898 -1.541642 -0.482085
2013-01-04 -1.120391 -0.349629 -0.703114 -1.182272
2013-01-05  0.467696  0.804033  1.059557 -0.258913
2013-01-06  0.584083  0.313591  0.416921  1.545715

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [7]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.986401  1.169657 -1.687242  2.392745
2013-01-02  0.808653 -0.623405  0.848104  0.043162
2013-01-03  1.004945  1.660898 -1.541642 -0.482085
2013-01-04 -1.120391 -0.349629 -0.703114 -1.182272
2013-01-05  0.467696  0.804033  1.059557 -0.258913

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.120391 -0.349629 -0.703114 -1.182272
2013-01-05  0.467696  0.804033  1.059557 -0.258913
2013-01-06  0.584083  0.313591  0.416921  1.545715

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.455231  0.495857 -0.267903  0.343059
std    0.801071  0.883981  1.208548  1.349622
min   -1.120391 -0.623405 -1.687242 -1.182272
25%    0.496793 -0.183824 -1.332010 -0.426292
50%    0.696368  0.558812 -0.143097 -0.107875
75%    0.941964  1.078251  0.740308  1.170077
max    1.004945  1.660898  1.059557  2.392745

In [16]:
df.loc["20130102", ["A", "B"]]

A    0.808653
B   -0.623405
Name: 2013-01-02 00:00:00, dtype: float64

In [17]:
df.loc["20130102", "A"]

np.float64(0.8086530134391878)

In [18]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

In [19]:
tuple

tuple

In [20]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [21]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [22]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [23]:
df

                     A         B
first second
bar   one    -0.241657  1.047524
      two     0.549887  0.525015
baz   one    -1.452207  0.701823
      two    -1.729104  0.280656
foo   one     1.110775 -0.242792
      two    -1.285232 -1.211176
qux   one    -1.051101 -0.088188
      two     0.598638 -0.065422

In [24]:
df2 = df[:4]

In [25]:
df2

                     A         B
first second
bar   one    -0.241657  1.047524
      two     0.549887  0.525015
baz   one    -1.452207  0.701823
      two    -1.729104  0.280656

In [26]:
stacked = df2.stack()

In [27]:
stacked

first  second
bar    one     A   -0.241657
               B    1.047524
       two     A    0.549887
               B    0.525015
baz    one     A   -1.452207
               B    0.701823
       two     A   -1.729104
               B    0.280656
dtype: float64

In [28]:
stacked.unstack(1)

second        one       two
first
bar   A -0.241657  0.549887
      B  1.047524  0.525015
baz   A -1.452207 -1.729104
      B  0.701823  0.280656

In [29]:
stacked.unstack()

                     A         B
first second
bar   one    -0.241657  1.047524
      two     0.549887  0.525015
baz   one    -1.452207  0.701823
      two    -1.729104  0.280656

In [30]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.241657 -1.452207
       B  1.047524  0.701823
two    A  0.549887 -1.729104
       B  0.525015  0.280656

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [4]:
df

        A  B    C         D         E
0     one  A  foo  1.712689  1.001185
1     one  B  foo -0.412858 -0.212781
2     two  C  foo -1.129232 -1.333904
3   three  A  bar -1.037562  0.131382
4     one  B  bar -0.029766 -0.942997
5     one  C  bar  0.139062 -2.176121
6     two  A  foo -0.538948 -3.023070
7   three  B  foo  1.071507 -0.557921
8     one  C  foo  2.019069 -0.043509
9     one  A  bar  0.841421  1.534635
10    two  B  bar  0.670676  1.134894
11  three  C  bar -0.359004 -1.602990

In [5]:
df.pivot_table(values=["D","E"], index=["A", "B"], columns="C")

                D                   E
C             bar       foo       bar       foo
A     B
one   A  0.841421  1.712689  1.534635  1.001185
      B -0.029766 -0.412858 -0.942997 -0.212781
      C  0.139062  2.019069 -2.176121 -0.043509
three A -1.037562       NaN  0.131382       NaN
      B       NaN  1.071507       NaN -0.557921
      C -0.359004       NaN -1.602990       NaN
two   A       NaN -0.538948       NaN -3.023070
      B  0.670676       NaN  1.134894       NaN
      C       NaN -1.129232       NaN -1.333904

In [6]:
df.pivot_table(values="D", index=["A", "B"], columns=["C","E"])

C             bar                                                         foo  \
E       -2.176121 -1.602990 -0.942997  0.131382  1.134894  1.534635 -3.023070
A     B
one   A       NaN       NaN       NaN       NaN       NaN  0.841421       NaN
      B       NaN       NaN -0.029766       NaN       NaN       NaN       NaN
      C  0.139062       NaN       NaN       NaN       NaN       NaN       NaN
three A       NaN       NaN       NaN -1.037562       NaN       NaN       NaN
      B       NaN       NaN       NaN       NaN       NaN       NaN       NaN
      C       NaN -0.359004       NaN       NaN       NaN       NaN       NaN
two   A       NaN       NaN       NaN       NaN       NaN       NaN -0.538948
      B       NaN       NaN       NaN       NaN  0.670676       NaN       NaN
      C       NaN       NaN       NaN       NaN       NaN       NaN       NaN

C
E       -1.333904 -0.557921 -0.212781 -0.043509  1.001185
A     B
one   A       NaN       NaN       NaN       NaN  1.712689
      B       NaN       NaN -0.412858       NaN       NaN
      C       NaN       NaN       NaN  2.019069       NaN
three A       NaN       NaN       NaN       NaN       NaN
      B       NaN  1.071507       NaN       NaN       NaN
      C       NaN       NaN       NaN       NaN       NaN
two   A       NaN       NaN       NaN       NaN       NaN
      B       NaN       NaN       NaN       NaN       NaN
      C -1.129232       NaN       NaN       NaN       NaN

In [7]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

C:\Users\I527896\AppData\Local\Temp\ipykernel_23672\1178421381.py:1: FutureWarning: 'S' is deprecated and will be removed in a future version, please use 's' instead.
  rng = pd.date_range("1/1/2012", periods=100, freq="S")

In [8]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

In [ ]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='s')

: